Revit 2027 API
ConnectorElement.SystemClassification Property
 The system classification of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPSystemClassification SystemClassification { get; set; }
Public Property SystemClassification As MEPSystemClassification
	Get
	Set
public:
property MEPSystemClassification SystemClassification {
	MEPSystemClassification get ();
	void set (MEPSystemClassification value);
}
member SystemClassification : MEPSystemClassification with get, set
Property Value
MEPSystemClassification
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
ArgumentsInconsistentException |  When setting this property: The MEPSystemType is not valid for the domain of this connector.
See Also
Reference
ConnectorElement Class
Autodesk.Revit.DB Namespace